2_CAD_Structure/sim/NACA0012_new_postGeo/constant/polyMesh/blockMeshDict
FoamFile
{
	version		2.0;
	format	 	ascii;
	class		dictionary;
	object		blockMeshDict;
}

convertToMeters 1;

vertices
{
	(-0.5 0.5 -0.5)	// 0
	(0.5 0.5 -0.5)	// 1
	(0.5 0 -0.5)	// 2
	(-0.5 0 -0.5)	// 3
	(-0.5 0.5 0.5)	// 4
	(0.5 0.5 0.5)	// 5
	(0.5 0 0.5)	// 6
	(-0.5 0 0.5)	// 7

};

blocks
{
	hex (0 1 2 3 4 5 6 7) (50 25 50) simpleGrading (1 1 1)
	
};

edges
{

};

boundary
{
	walls
	{
		type wall;
		faces
		(
			(0 4 5 1)
			(2 6 7 3)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			(3 7 4 0)
		);
	}
	
	outlet
	{
		type patch;
		faces
		(
			(2 1 5 6)
		);
	}
	
	frontAndBack
	{
		type wall;
		faces
		(
			(1 2 3 0)
			(7 6 5 4)
		);
	}
}
